In [1]:
import pandas as pd
import numpy as np

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)),
                 columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()

df['teks'] = list('ABCDE')
df

F:\Anaconda\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          1.0         16    A
1 2000-01-01 01:00:00         13.0          3    B
2 2000-01-01 02:00:00          4.0          9    C
3 2000-01-01 03:00:00          7.0         14    D
4 2000-01-01 04:00:00         11.0         14    E

In [3]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

# Memilih kolom bertipe data numerik

In [4]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          1.0         16
1         13.0          3
2          4.0          9
3          7.0         14
4         11.0         14

In [5]:
df.select_dtypes(include='int')

   bil_bulat
0         16
1          3
2          9
3         14
4         14

In [6]:
df.select_dtypes(include='float')

   bil_pecahan
0          1.0
1         13.0
2          4.0
3          7.0
4         11.0

# Memilih kolom bertipe data string atau objek

In [7]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

# Memilih kolom bertipe data datetime

In [8]:
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [9]:
df.select_dtypes(include=['object','number'])

   bil_pecahan  bil_bulat teks
0          1.0         16    A
1         13.0          3    B
2          4.0          9    C
3          7.0         14    D
4         11.0         14    E

In [10]:
df.select_dtypes(include=['datetime','object'])

                index teks
0 2000-01-01 00:00:00    A
1 2000-01-01 01:00:00    B
2 2000-01-01 02:00:00    C
3 2000-01-01 03:00:00    D
4 2000-01-01 04:00:00    E